# Multiindex

In [1]:
import pandas as pd

In [2]:
pd.read_csv('bigmac.csv')

       Date        Country  Price in US Dollars
0    1/2016      Argentina                 2.39
1    1/2016      Australia                 3.74
2    1/2016         Brazil                 3.35
3    1/2016        Britain                 4.22
4    1/2016         Canada                 4.14
..      ...            ...                  ...
647  1/2010         Turkey                 3.83
648  1/2010            UAE                 2.99
649  1/2010        Ukraine                 1.83
650  1/2010  United States                 3.58
651  1/2010        Uruguay                 3.32

[652 rows x 3 columns]

In [6]:
bigmac = pd.read_csv('bigmac.csv')

In [7]:
mask_country = bigmac['Country'] == 'Poland'

In [8]:
bigmac[mask_country]

       Date Country  Price in US Dollars
26   1/2016  Poland                 2.37
82   7/2015  Poland                 2.54
138  1/2015  Poland                 2.48
195  7/2014  Poland                 3.00
252  1/2014  Poland                 3.00
310  7/2013  Poland                 2.73
367  1/2013  Poland                 2.94
423  7/2012  Poland                 2.63
480  1/2012  Poland                 2.58
537  7/2011  Poland                 3.09
593  7/2010  Poland                 2.60
636  1/2010  Poland                 2.86

In [9]:
bigmac[mask_country].mean()

C:\Users\Tom\AppData\Local\Temp\ipykernel_4496\646819654.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  bigmac[mask_country].mean()

Price in US Dollars    2.735
dtype: float64

In [10]:
mask_country = bigmac['Country'] == 'United States'

In [11]:
bigmac[mask_country].mean()

C:\Users\Tom\AppData\Local\Temp\ipykernel_4496\646819654.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  bigmac[mask_country].mean()

Price in US Dollars    4.3975
dtype: float64

In [12]:
bigmac[mask_country]

       Date        Country  Price in US Dollars
40   1/2016  United States                 4.93
96   7/2015  United States                 4.79
152  1/2015  United States                 4.79
209  7/2014  United States                 4.80
266  1/2014  United States                 4.62
324  7/2013  United States                 4.56
381  1/2013  United States                 4.37
437  7/2012  United States                 4.33
494  1/2012  United States                 4.20
551  7/2011  United States                 4.07
607  7/2010  United States                 3.73
650  1/2010  United States                 3.58

In [13]:
pd.read_csv('bigmac.csv', parse_dates=['Date'])

          Date        Country  Price in US Dollars
0   2016-01-01      Argentina                 2.39
1   2016-01-01      Australia                 3.74
2   2016-01-01         Brazil                 3.35
3   2016-01-01        Britain                 4.22
4   2016-01-01         Canada                 4.14
..         ...            ...                  ...
647 2010-01-01         Turkey                 3.83
648 2010-01-01            UAE                 2.99
649 2010-01-01        Ukraine                 1.83
650 2010-01-01  United States                 3.58
651 2010-01-01        Uruguay                 3.32

[652 rows x 3 columns]

In [14]:
bigmac = pd.read_csv('bigmac.csv', parse_dates=['Date'])
bigmac.head(n=2)

        Date    Country  Price in US Dollars
0 2016-01-01  Argentina                 2.39
1 2016-01-01  Australia                 3.74

In [15]:
bigmac.head(3)

        Date    Country  Price in US Dollars
0 2016-01-01  Argentina                 2.39
1 2016-01-01  Australia                 3.74
2 2016-01-01     Brazil                 3.35

In [16]:
bigmac.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 652 entries, 0 to 651
Data columns (total 3 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Date                 652 non-null    datetime64[ns]
 1   Country              652 non-null    object
 2   Price in US Dollars  652 non-null    float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 15.4+ KB

In [17]:
bigmac.dtypes

Date                   datetime64[ns]
Country                        object
Price in US Dollars           float64
dtype: object